# Data Analysis with Pandas - Problem Set


#### Reading in Data

1. Read in the comma-separated file "client_list.csv". Assign as variable `df1`.
2. Read in the delimted file "client_list.table". Assign as variable as `df2`.
3. Read in the fixed-width file "client_list.txt". Assign as variable `df3`
4. Read in the comma-separated file "client_list.csv", skip the first 3 rows, and ignore the header. Do not assign to variable (just return a view).
5. Read in the comma-separated file "client_list.csv". Set the column headers in all caps. Assign as variable `df`.
6. Read in the comma-separated file "client_list_practice.csv" and only extract the columns ["FIRST_NAME","AGE","EYE_COLOR"]. Do not assign to a variable.

In [2]:
import pandas as pd

In [3]:
#pr1
df1 = pd.read_csv("client_list.csv")

In [9]:
#pr2
df2 = pd.read_csv("client_list.table", sep=';')
df2.head()

  first_name LAST_NAME gender  Age Hair_COLOR eye_Color
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

In [6]:
#pr3
df3 = pd.read_fwf("client_list.txt")

In [10]:
#pr4
pd.read_csv("client_list.csv", skiprows=4, header=None)

           0         1  2   3       4      5
0       Mary     Adams  F  42  blonde   blue
1     Robert  Phillips  M  37  blonde  brown
2     Thomas     Moore  M  60   brown   blue
3    Natalie    Potter  F  21   brown  green
4     Brenda     Jones  F  18  blonde  brown
5    Michael     Smith  M  58   brown  brown
6   Jennifer     Smith  F  36   black  brown
7    Michael     Smith  M  37   black  hazel
8    Jessica    Rabbit  F  19   black   blue
9      Molly    Bryant  F  21   brown   blue
10     Jaime  Anderson  F  46   brown  green

In [17]:
#pr5
df = pd.read_csv("client_list.csv")
df.columns = [i.upper() for i in df.columns]
df

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
0    Jennifer     Jones      F   27      black     brown
1       Jaime   Roberts      M   32      brown     hazel
2     Michael   Johnson      M   55        red     green
3        Mary     Adams      F   42     blonde      blue
4      Robert  Phillips      M   37     blonde     brown
5      Thomas     Moore      M   60      brown      blue
6     Natalie    Potter      F   21      brown     green
7      Brenda     Jones      F   18     blonde     brown
8     Michael     Smith      M   58      brown     brown
9    Jennifer     Smith      F   36      black     brown
10    Michael     Smith      M   37      black     hazel
11    Jessica    Rabbit      F   19      black      blue
12      Molly    Bryant      F   21      brown      blue
13      Jaime  Anderson      F   46      brown     green

In [37]:
#pr6
pd.read_csv("client_list_practice.csv", usecols=["FIRST_NAME", "AGE", "EYE_COLOR"])
"""a = pd.read_csv("client_list_practice.csv")
a[['FIRST_NAME', 'AGE']]"""

   FIRST_NAME   AGE
0    Jennifer  27.0
1       Jaime  32.0
2     Michael  55.0
3        Mary  42.0
4         NaN  37.0
5      Thomas  60.0
6     Natalie   NaN
7      Brenda   NaN
8     Michael  58.0
9    Jennifer  36.0
10    Michael  37.0
11    Jessica  19.0
12      Molly  21.0
13      Jaime  46.0

#### Slicing a Data Set

7. Slice rows 5 through 11 of `df`. Can you provide two ways of doing this?
8. Return only the columns ['LAST_NAME','AGE','HAIR_COLOR'] for `df`. Can you provide two ways of doing this?
9. Combine problems 1 and 2: return rows 5 though 11 and columns  ['LAST_NAME','AGE','HAIR_COLOR'] for `df`. Can you provide two ways of doing this?

In [38]:
#pr7
df.loc[5:11]
df.iloc[5:12]
df[5:12]

   FIRST_NAME LAST_NAME GENDER   AGE HAIR_COLOR EYE_COLOR
5      Thomas     Moore      M  60.0      brown      blue
6     Natalie    Potter      F   NaN      brown     green
7      Brenda     Jones      F   NaN        NaN     brown
8     Michael     Smith    NaN  58.0      brown     brown
9    Jennifer     Smith      F  36.0      black     brown
10    Michael     Smith      M  37.0      black     hazel
11    Jessica       NaN      F  19.0      black      blue

In [39]:
#pr8
df[['LAST_NAME', 'AGE', 'HAIR_COLOR']]
df.loc[:, ['LAST_NAME', 'AGE', 'HAIR_COLOR']]

   LAST_NAME   AGE HAIR_COLOR
0      Jones  27.0      black
1    Roberts  32.0      brown
2    Johnson  55.0        red
3        NaN  42.0     blonde
4   Phillips  37.0        NaN
5      Moore  60.0      brown
6     Potter   NaN      brown
7      Jones   NaN        NaN
8      Smith  58.0      brown
9      Smith  36.0      black
10     Smith  37.0      black
11       NaN  19.0      black
12    Bryant  21.0      brown
13  Anderson  46.0      brown

In [42]:
#pr9
df[5:12][['LAST_NAME','AGE','HAIR_COLOR']]
df.loc[5:11, ['LAST_NAME', 'AGE', 'HAIR_COLOR']]

   LAST_NAME  AGE HAIR_COLOR
5      Moore   60      brown
6     Potter   21      brown
7      Jones   18     blonde
8      Smith   58      brown
9      Smith   36      black
10     Smith   37      black
11    Rabbit   19      black

#### Simple Queries

10. Find the subset of `df` where the client's last name is "Smith".
11. Find the subset of `df` where the client's hair color is not black.
12. Find the subset of `df` where the client's hair color is red and reset the values to "ginger".

In [41]:
#pr10
df[df['LAST_NAME'] == 'Smith']
df.query('LAST_NAME == "Smith"') # second method

   FIRST_NAME LAST_NAME GENDER   AGE HAIR_COLOR EYE_COLOR
8     Michael     Smith    NaN  58.0      brown     brown
9    Jennifer     Smith      F  36.0      black     brown
10    Michael     Smith      M  37.0      black     hazel

In [45]:
#pr11
df[df['HAIR_COLOR'] != 'black']
df.query('HAIR_COLOR != "black"')

   FIRST_NAME LAST_NAME GENDER   AGE HAIR_COLOR EYE_COLOR
1       Jaime   Roberts      M  32.0      brown     hazel
2     Michael   Johnson      M  55.0        red     green
3        Mary       NaN      F  42.0     blonde       NaN
4         NaN  Phillips      M  37.0        NaN     brown
5      Thomas     Moore      M  60.0      brown      blue
6     Natalie    Potter      F   NaN      brown     green
7      Brenda     Jones      F   NaN        NaN     brown
8     Michael     Smith    NaN  58.0      brown     brown
12      Molly    Bryant      F  21.0      brown      blue
13      Jaime  Anderson      F  46.0      brown     green

In [46]:
#pr12
df.loc[df["HAIR_COLOR"] == "red" , "HAIR_COLOR"] = "ginger"
df[df['HAIR_COLOR'] == 'ginger']

  FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
2    Michael   Johnson      M   55     ginger     green

#### Complex Queries

13. Find the subset of `df` where the clients are females older than 30 years.
14. Repeat problem 1, but return only the hair color and eye color.
15. Find the unique combination of hair and eye color for women older than 25 years.

In [48]:
#pr13
df[ ( df['GENDER'] == 'F') & ( df['AGE'] > 30) ]

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
3        Mary     Adams      F   42     blonde      blue
9    Jennifer     Smith      F   36      black     brown
13      Jaime  Anderson      F   46      brown     green

In [49]:
#pr14
# problem 1 ile 13. alıştırma kastediliyorsa aşağıdaki şekilde cevap veriyorum. sheet teki ilk problem assign ile ilgiliydi çünkü.
df[ ( df['GENDER'] == 'F') & ( df['AGE'] > 30) ][['HAIR_COLOR','EYE_COLOR']]

   HAIR_COLOR EYE_COLOR
3      blonde      blue
9       black     brown
13      brown     green

In [59]:
df[ ( df['GENDER'] == 'F') & ( df['AGE'] > 25) ][['HAIR_COLOR','EYE_COLOR']].drop_duplicates()

   HAIR_COLOR EYE_COLOR
3      blonde      blue
9       black     brown
13      brown     green


#### Additional Dataframe Operations

16. Perform a `merge` using "client_list.csv" and "customer_id_list.csv". Assign the resulting dataframe as `clients`.
17. Perform a `merge` using `clients` and "purchase_log.csv" and limit the subset to only clients who made purchases. Assign the resulting dataframe as `detailed_sales`.
18. Use `groupby` to find the client who spent the most money on purchases. Determine how much he/she spent. HINT: save the intermediate dataframe from using `groupby` as `spenders` before applying slicing to determine the client who spent the most money on purchases.
19. (BONUS) Modify the answer to problem 3 slightly to determine exactly what items where purchased by the top spending client.

In [46]:
#16
clist  = pd.read_csv('client_list.csv')
idlist = pd.read_csv('customer_id_list.csv')
clist.columns = [c.upper() for c in clist.columns]
clients = pd.merge(clist, idlist, on=['LAST_NAME','FIRST_NAME','GENDER','AGE'], how='inner')
clients

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR  CUSTOMER_ID
0    Jennifer     Jones      F   27      black     brown            1
1       Jaime   Roberts      M   32      brown     hazel            2
2     Michael   Johnson      M   55        red     green            3
3        Mary     Adams      F   42     blonde      blue            4
4      Robert  Phillips      M   37     blonde     brown            5
5      Thomas     Moore      M   60      brown      blue            6
6     Natalie    Potter      F   21      brown     green            7
7      Brenda     Jones      F   18     blonde     brown            8
8     Michael     Smith      M   58      brown     brown            9
9    Jennifer     Smith      F   36      black     brown           10
10    Michael     Smith      M   37      black     hazel           11
11    Jessica    Rabbit      F   19      black      blue           12
12      Molly    Bryant      F   21      brown      blue           13
13      Jaime  Anderson      F   46      brown     green           14

In [48]:
#pr 17
plog  = pd.read_csv('purchase_log.csv')
detailed_sales = pd.merge(clients, plog, on=['CUSTOMER_ID'], how='inner')
detailed_sales

,FIRST_NAME,LAST_NAME,GENDER,AGE,HAIR_COLOR,EYE_COLOR,CUSTOMER_ID,DATE,SKU,ITEM_DESCRIPTION,PRICE
0,Jennifer,Jones,F,27,black,brown,1,01/01/2015,39490,aspirin,12.99
1,Jaime,Roberts,M,32,brown,hazel,2,12/24/2014,39933,gift card,50.00
2,Mary,Adams,F,42,blonde,blue,4,10/31/2014,94586,Superman costume,39.99
3,Thomas,Moore,M,60,brown,blue,6,09/13/2014,22495,birthday card,3.99
4,Michael,Smith,M,58,brown,brown,9,02/14/2015,23493,box of chocolates,29.99
5,Michael,Smith,M,58,brown,brown,9,02/14/2015,38349,bottle of champagne,199.99
6,Michael,Smith,M,37,black,hazel,11,03/01/2015,60385,Nike Lunarglide 6-size8.5,109.99
7,Jaime,Anderson,F,46,brown,green,14,03/17/2014,3844,green tie,14.99

In [49]:
#pr18
spenders = detailed_sales.groupby('CUSTOMER_ID')['PRICE'].sum().reset_index()
spenders
spenders[spenders.PRICE==spenders.PRICE.max()]

   CUSTOMER_ID   PRICE
4            9  229.98

In [103]:
#19
detailed_sales
max_spender = spenders[spenders.PRICE==spenders.PRICE.max()]
max_spender_reset = spenders[spenders.PRICE==spenders.PRICE.max()].reset_index(drop=True).loc[0,'CUSTOMER_ID'] # detayını öğren
detailed_sales[detailed_sales.CUSTOMER_ID==max_spender_reset]['ITEM_DESCRIPTION']

4      box of chocolates
5    bottle of champagne
Name: ITEM_DESCRIPTION, dtype: object

#### Writing Files

20. Save `detailed_sales` as a csv file named "df_out.csv" with no indices.
21. Save `detailed_sales` to a pickle file named "df_out.p"

In [104]:
detailed_sales.to_csv("df_out.csv", index=False)

In [105]:
detailed_sales.to_pickle("df_out.p")